{
  "format": "layers-model",
  "generatedBy": "keras v2.9.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": {
    "keras_version": "2.9.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_7",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                30,
                63
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "lstm_21_input"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_21",
              "trainable": true,
              "batch_input_shape": [
                null,
                30,
                63
              ],
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_22",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 256,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_23",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "relu",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0,
              "recurrent_dropout": 0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_28",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_15",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_29",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_16",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_30",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l2": 0.0010000000474974513
                }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_17",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_31",
              "trainable": true,
              "dtype": "float32",
              "units": 26,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "categorical_accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_28/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_28/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_29/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_29/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_30/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_30/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_31/kernel",
          "shape": [
            64,
            26
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_31/bias",
          "shape": [
            26
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_21/lstm_cell_21/kernel",
          "shape": [
            63,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_21/lstm_cell_21/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_21/lstm_cell_21/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_22/lstm_cell_22/kernel",
          "shape": [
            64,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_22/lstm_cell_22/recurrent_kernel",
          "shape": [
            256,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_22/lstm_cell_22/bias",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_23/lstm_cell_23/kernel",
          "shape": [
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_23/lstm_cell_23/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_23/lstm_cell_23/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}